{
  "en": {
    "nav_logo": "Juan Manuel Campos",
    "nav_about": "About",
    "nav_skills": "Skills",
    "nav_projects": "Projects",
    "nav_contact": "Contact",
    "nav_CV": "CV",
    "presentation_h1": "Juan Manuel Campos",
    "presentation_h2": "Full Stack Web Developer ",
    "presentation_p": "Turning your ideas into fully functional websites",
    "about_h2": "About Me",
    "about_p1": "I'm a Systems Engineering student passionate about web development. I started by exploring new web technologies, and now I enjoy creating projects that combine both frontend and backend technologies.",
    "about_p2": "I've developed stylized websites like this portfolio, gaining experience in HTML, CSS, JS and React. I'm also familiar with simple database management. I'm always looking to improve my skills, learn new tools, and work on challenging projects.",
    "skills_h2": "My Skills",
    "skill_python_h3": "Python",
    "skill_python_p": "Building backend logic (with Flask) and automation scripts.",
    "skill_flask_h3": "React",
    "skill_flask_p": "Developing modern, scalable front-end solutions.",
    "skill_sqlite_h3": "Node.js",
    "skill_sqlite_p": "Developing backend services and connecting to databases.",
    "skill_raspberry_h3": "Responsive Design",
    "skill_raspberry_p": "Crafting webpages orientated to all devices, specially mobile.",
    "skill_web_h3": "Light Webpages",
    "skill_web_p": "Using HTML, CSS and a bit of JS. Just like this webpage!",
    "skill_git_h3": "Git and Github",
    "skill_git_p": "Version control, collaboration and maintenance of codebases",
    "projects_h2": "My Projects",
    "project1_h3": "Smart Inventory Control",
    "project1_p1": "This project introduced me to automation and backend logic using a Raspberry Pi 4. Im building a real-time inventory system with sensors, Python, and a local database, accessible through a simple Flask web app.",
    "project1_stack": "Raspberry Pi 4, Python, Flask, HTML, CSS, SQLite, GPIO",
    "project1_p2": "It helped me understand how hardware and software interact, and gave me hands-on experience with web technologies, IoT, and local server hosting.",
    "project1_link": "View on GitHub (not finished)",
    "project2_h3": "Home Server",
    "project2_p1": "This project helped me truly understand how computers communicate behind the scenes. I set up a local server to explore networking, remote access, and web hosting from scratch. Through it, I hosted small Flask web apps, managed file transfers with Samba, and configured basic security using UFW and Fail2Ban.",
    "project2_stack": "Ubuntu Server, Flask, Python, SSH, Samba, UFW",
    "project2_p2": "This experience gave me a deeper appreciation for backend infrastructure and sparked my interest in server automation and DevOps.",
    "project2_link": "View on GitHub (not uploaded yet)",
    "project3_h3": "Todo App",
    "project3_p1": "A simple yet powerful Todo application built with Flask and SQLAlchemy that helps users manage their daily tasks efficiently.",
    "project3_p2": "",
    "project3_stack": "Python Flask, SQLalchemy, HTML, CSS",
    "project3_link": "View on GitHub",
    "project4_h3": "Modern Portfolio Website",
    "project4_p1": "This webpage is my own Portfolio totally made by me! I learned some new functions of HTML, CSS and JS. In the near future this project will be migrated to react!",
    "project4_stack": "HTML, CSS, JS",
    "project4_p2": "This was my first time actually using Javascript in a real webpage to show my frontend skills. A GitHub repo is available to show how the webpage is evolving.",
    "project4_link": "View on GitHub",
    "project4_overview1": "A modern and responsive portfolio website showcasing my journey as a web developer. Built from scratch using vanilla technologies to demonstrate core development skills.",
    "project4_overview2": "Features include multilingual support, interactive project showcases, email integration, and responsive design principles.",
    "project4_tech1": "HTML5 - Semantic structure and accessibility",
    "project4_tech2": "CSS3 - Modern styling with Flexbox and Grid",
    "project4_tech3": "JavaScript - Dynamic content and interactions",
    "project4_tech4": "EmailJS - Contact form functionality",
    "project4_tech_additional": "Additional tools:",
    "project4_tech5": "Font Awesome - Icons and visual elements",
    "project4_tech6": "Google Fonts - Typography",
    "project4_tech7": "GitHub Pages - Hosting and deployment",
    "project4_dev1": "The development process focused on creating a clean, maintainable codebase with these key aspects:",
    "project4_dev2": "Modular JavaScript architecture",
    "project4_dev3": "Responsive design implementation",
    "project4_dev4": "Internationalization system",
    "project4_dev5": "Performance optimization",
    "project4_dev6": "Future plans include integrating Flask backend and expanding project functionality.",
    "project4_results1": "Key achievements:",
    "project4_results2": "Fully responsive design across all devices",
    "project4_results3": "Support for multiple languages",
    "project4_results4": "Clean and maintainable code structure",
    "project4_results5": "Improved frontend development skills",
    "project4_results6": "Enhanced understanding of web accessibility",
    "contact_h2": "Contact Me",
    "contact_name_label": "Name and Surname",
    "contact_name_placeholder": "Enter your full name",
    "contact_email_label": "Email",
    "contact_email_placeholder": "Enter your email",
    "contact_message_label": "Message",
    "contact_message_placeholder": "Write your message",
    "contact_button": "Send Message",
    "contact_email_link": "juanmanuelccampos@gmail.com",
    "contact_linkedin": "juanmaacampos",
    "contact_github": "juanmaacampos",
    "footer": "© {year} JMCdev | All rights reserved",
    "web_application": "WEB APPLICATION",
    "overview": "Overview",
    "technologies": "Technologies",
    "development": "Development",
    "results": "Results",
    "technologies_title": "Stack:",
    "python_flask": "Python Flask - Backend framework",
    "sqlalchemy": "SQLalchemy - Database ORM",
    "html": "HTML - Structure",
    "css": "CSS - Styling",
    "project3_tech": "Additional technologies:",
    "sqlite": "SQLite - Database",
    "flask_login": "Flask-Login - User authentication",
    "bootstrap": "Bootstrap - Frontend framework",
    "project3_dev1": "The development process started with setting up a Flask environment and designing the database schema for tasks.",
    "project3_dev2": "Key challenges included:",
    "project3_dev3": "Implementing user authentication",
    "project3_dev4": "Managing database relationships",
    "project3_dev5": "Creating an intuitive user interface",
    "project3_results1": "The project successfully demonstrated:",
    "project3_results2": "Practical understanding of MVC architecture",
    "project3_results3": "Database management with SQLAlchemy",
    "project3_results4": "User authentication implementation",
    "project3_results5": "Frontend and backend integration"
  },
  "es": {
    "nav_logo": "Juan Manuel Campos",
    "nav_about": "Sobre mí",
    "nav_skills": "Habilidades",
    "nav_projects": "Proyectos",
    "nav_contact": "Contacto",
    "nav_CV": "CV",
    "presentation_h1": "Juan Manuel Campos",
    "presentation_h2": "Desarrollador Web Full Stack",
    "presentation_p": "¡Convirtiendo tus ideas en sitios web completamente funcionales!",
    "about_h2": "Sobre mí",
    "about_p1": "Soy un estudiante de Ingeniería en Sistemas apasionado por el desarrollo web. Comencé explorando nuevas tecnologías web, y ahora disfruto creando proyectos que combinan tecnologías frontend y backend.",
    "about_p2": "He desarrollado sitios web con estilo como este portafolio, adquiriendo experiencia en HTML, CSS, JS y React. También tengo conocimientos basico en gestión de bases de datos. Siempre busco mejorar mis habilidades, aprender nuevas herramientas y trabajar en proyectos desafiantes.",
    "skills_h2": "Mis Habilidades",
    "skill_python_h3": "Python",
    "skill_python_p": "Construcción de lógica backend (con Flask) y scripts de automatización.",
    "skill_flask_h3": "React",
    "skill_flask_p": "Desarrollo de soluciones frontend modernas y escalables.",
    "skill_sqlite_h3": "Node.js",
    "skill_sqlite_p": "Desarrollo de servicios backend y conexión con bases de datos.",
    "skill_raspberry_h3": "Diseño Responsivo",
    "skill_raspberry_p": "Creación de páginas web orientadas a todos los dispositivos, especialmente móviles.",
    "skill_web_h3": "Páginas Web Ligeras",
    "skill_web_p": "Usando HTML, CSS y un poco de JS. ¡Como esta página web!",
    "skill_git_h3": "Git y Github",
    "skill_git_p": "Control de versiones, colaboración y mantenimiento de bases de código",
    "projects_h2": "Mis Proyectos",
    "project1_h3": "Control de Inventario Inteligente",
    "project1_p1": "Este proyecto me introdujo a la automatización y la lógica backend usando una Raspberry Pi 4. Estoy construyendo un sistema de inventario en tiempo real con sensores, Python y una base de datos local, accesible a través de una aplicación web simple con Flask.",
    "project1_stack": "Raspberry Pi 4, Python, Flask, HTML, CSS, SQLite, GPIO",
    "project1_p2": "Me ayudó a entender cómo interactúan el hardware y el software, y me dio experiencia práctica con tecnologías web, IoT y alojamiento de servidores locales.",
    "project1_link": "Ver en GitHub (no finalizado)",
    "project2_h3": "Servidor Doméstico",
    "project2_p1": "Este proyecto me ayudó a comprender verdaderamente cómo se comunican las computadoras detrás de escena. Configuré un servidor local para explorar redes, acceso remoto y alojamiento web desde cero.",
    "project2_stack": "Ubuntu Server, Flask, Python, SSH, Samba, UFW",
    "project2_p2": "Esta experiencia me dio una mayor apreciación por la infraestructura backend y despertó mi interés en la automatización de servidores y DevOps.",
    "project2_link": "Ver en GitHub (aún no subido)",
    "project3_h3": "Aplicación de Tareas",
    "project3_p1": "Una aplicación de tareas simple pero potente construida con Flask y SQLAlchemy que ayuda a los usuarios a gestionar sus tareas diarias de manera eficiente.",
    "project3_stack": "Python Flask, SQLalchemy, HTML, CSS",
    "project3_link": "Ver en GitHub",
    "project4_h3": "Sitio Web de Portafolio Moderno",
    "project4_p1": "¡Esta página web es mi propio portafolio, completamente hecho por mí! Aprendí nuevas funciones de HTML, CSS y JS. ¡En un futuro cercano este proyecto será migrado a React!",
    "project4_stack": "HTML, CSS, JS",
    "project4_p2": "Esta fue mi primera vez usando JavaScript en una página web real para mostrar mis habilidades frontend. Hay un repositorio de GitHub disponible para mostrar cómo evoluciona la página.",
    "footer": "© {year} JMCdev | Todos los derechos reservados"
  },
  "pt": {
    "nav_logo": "Juan Manuel Campos",
    "nav_about": "Sobre",
    "nav_skills": "Habilidades",
    "nav_projects": "Projetos",
    "nav_contact": "Contato",
    "nav_CV": "CV",
    "presentation_h1": "Juan Manuel Campos",
    "presentation_h2": "Desenvolvedor Web Full Stack",
    "presentation_p": "Transformando suas ideias em sites totalmente funcionais!",
    "about_h2": "Sobre mim",
    "about_p1": "Sou um estudante de Engenharia de Sistemas apaixonado por desenvolvimento web. Comecei explorando novas tecnologias web, e agora gosto de criar projetos que combinam tecnologias frontend e backend.",
    "about_p2": "Desenvolvi sites estilizados como este portfólio, ganhando experiência com HTML, CSS, JS e React. Também tenho conhecimentos basico em gerenciamento de banco de dados. Estou sempre buscando melhorar minhas habilidades, aprender novas ferramentas e trabalhar em projetos desafiadores.",
    "skills_h2": "Minhas Habilidades",
    "skill_python_h3": "Python",
    "skill_python_p": "Construção de lógica backend (com Flask) e scripts de automação.",
    "skill_flask_h3": "React",
    "skill_flask_p": "Desenvolvimento de soluções frontend modernas e escaláveis.",
    "skill_sqlite_h3": "Node.js",
    "skill_sqlite_p": "Desenvolvimento de serviços backend e conexão com bancos de dados.",
    "skill_raspberry_h3": "Design Responsivo",
    "skill_raspberry_p": "Criação de páginas web orientadas a todos os dispositivos, especialmente mobile.",
    "skill_web_h3": "Páginas Web Leves",
    "skill_web_p": "Usando HTML, CSS e um pouco de JS. Como esta página!",
    "skill_git_h3": "Git e Github",
    "skill_git_p": "Controle de versão, colaboração e manutenção de bases de código",
    "projects_h2": "Meus Projetos",
    "project1_h3": "Controle de Inventário Inteligente",
    "project1_p1": "Este projeto me introduziu à automação e lógica backend usando um Raspberry Pi 4. Estou construindo um sistema de inventário em tempo real com sensores, Python e banco de dados local, acessível através de uma aplicação web simples em Flask.",
    "project1_stack": "Raspberry Pi 4, Python, Flask, HTML, CSS, SQLite, GPIO",
    "project1_p2": "Me ajudou a entender como hardware e software interagem, e me deu experiência prática com tecnologias web, IoT e hospedagem de servidores locais.",
    "project1_link": "Ver no GitHub (não finalizado)",
    "project2_h3": "Servidor Doméstico",
    "project2_p1": "Este projeto me ajudou a entender verdadeiramente como os computadores se comunicam nos bastidores. Configurei um servidor local para explorar redes, acesso remoto e hospedagem web do zero.",
    "project2_stack": "Ubuntu Server, Flask, Python, SSH, Samba, UFW",
    "project2_p2": "Esta experiência me deu uma apreciação maior pela infraestrutura backend e despertou meu interesse em automação de servidores e DevOps.",
    "project2_link": "Ver no GitHub (ainda não enviado)",
    "project3_h3": "Aplicativo de Tarefas",
    "project3_p1": "Um aplicativo de tarefas simples mas poderoso construído com Flask e SQLAlchemy que ajuda os usuários a gerenciar suas tarefas diárias de forma eficiente.",
    "project3_stack": "Python Flask, SQLalchemy, HTML, CSS",
    "project3_link": "Ver no GitHub",
    "project4_h3": "Site de Portfólio Moderno",
    "project4_p1": "Este site é meu próprio portfólio, totalmente feito por mim! Aprendi novas funções de HTML, CSS e JS. Em um futuro próximo este projeto será migrado para React!",
    "project4_stack": "HTML, CSS, JS",
    "project4_p2": "Foi minha primeira vez usando JavaScript em um site real para mostrar minhas habilidades frontend. Um repositório no GitHub está disponível para mostrar como a página está evoluindo.",
    "footer": "© {year} JMCdev | Todos os direitos reservados"
  }
}