{
  "en": {
    "nav_logo": "Juan Manuel Campos",
    "nav_about": "About",
    "nav_skills": "Skills",
    "nav_projects": "Projects",
    "nav_contact": "Contact",
    "presentation_h1": "Juan Manuel Campos",
    "presentation_h2": "Backend Developer (in training)",
    "presentation_p": "Systems Engineering student, strongly interested in servers and automation and some other tech stuff like Raspberry Pi and IoT.",
    "about_h2": "About Me",
    "about_p1": "I'm a Systems Engineering student with a passion for building efficient and scalable backend systems. My journey started with a curiosity for how servers and networks operate, leading me to explore automation, IoT, and Raspberry Pi projects.",
    "about_p2": "Through hands-on projects like setting up home servers and developing real-time inventory systems, I've gained experience in Python, Flask, and database management. I'm always eager to learn new technologies and tackle challenging problems.",
    "skills_h2": "My Skills",
    "skill_python_h3": "Python",
    "skill_python_p": "Building backend logic and automation scripts. I learned through Thinkpython2 from Allen Downey.",
    "skill_flask_h3": "Flask",
    "skill_flask_p": "Developing lightweight web applications.",
    "skill_sqlite_h3": "SQLite",
    "skill_sqlite_p": "Managing local databases for projects.",
    "skill_raspberry_h3": "Raspberry Pi",
    "skill_raspberry_p": "Still learning how to use it for IOT on my projects.",
    "skill_web_h3": "Light Webpages",
    "skill_web_p": "Using HTML, CSS and a bit of JS. Just like this webpage!",
    "projects_h2": "My Projects",
    "project1_h3": "Smart Inventory Control",
    "project1_p1": "This project introduced me to automation and backend logic using a Raspberry Pi 4. I built a real-time inventory system with sensors, Python, and a local database, accessible through a simple Flask web app.",
    "project1_stack": "Raspberry Pi 4, Python, Flask, HTML, CSS, SQLite, GPIO",
    "project1_p2": "It helped me understand how hardware and software interact, and gave me hands-on experience with web technologies, IoT, and local server hosting.",
    "project1_link": "View on GitHub",
    "project2_h3": "Home Server",
    "project2_p1": "This project helped me truly understand how computers communicate behind the scenes. I set up a local server to explore networking, remote access, and web hosting from scratch. Through it, I hosted small Flask web apps, managed file transfers with Samba, and configured basic security using UFW and Fail2Ban.",
    "project2_stack": "Ubuntu Server, Flask, Python, SSH, Samba, UFW",
    "project2_p2": "This experience gave me a deeper appreciation for backend infrastructure and sparked my interest in server automation and DevOps.",
    "project2_link": "View on GitHub",
    "project3_h3": "To do app",
    "project3_p1": "This was my first project using flask on a webpage in combination with a simple and small database. It just was practice from the youtube channel freeCodeCamp",
    "project3_stack": "Python Flask, SQLalchemy, HTML, CSS",
    "project3_p2": "This was my first time using and learning a python framework and github for control version and my starting point in backend developing",
    "project3_link": "View on GitHub",
    "project4_h3": "Modern Porfolio Website",
    "project4_p1": "This webpage is my own Portfolio totally made by me! I learned some new functions of HTML, CSS and JS.In a near future this project will be using flask to mix my frontend with my backend!",
    "project4_stack": "HTML, CSS, JS",
    "project4_p2": "This was my first time actually using Javascript in a real webpage to show my frontend skills. A github repo is available to show how the webpage is evolving.",
    "project4_link": "View on GitHub",
    "contact_h2": "Contact Me",
    "contact_name_label": "Name and Surname",
    "contact_name_placeholder": "Enter your full name",
    "contact_email_label": "Email",
    "contact_email_placeholder": "Enter your email",
    "contact_message_label": "Message",
    "contact_message_placeholder": "Write your message",
    "contact_button": "Send Message",
    "contact_email_link": "juanmanuelccampos@gmail.com",
    "contact_linkedin": "juanmaacampos",
    "contact_github": "juanmaacampos",
    "footer": "© {year} Juanma Campos | This page was fully made by me ;)"
  },
  "es": {
    "nav_logo": "Juan Manuel Campos",
    "nav_about": "Sobre mí",
    "nav_skills": "Habilidades",
    "nav_projects": "Proyectos",
    "nav_contact": "Contacto",
    "presentation_h1": "Juan Manuel Campos",
    "presentation_h2": "Desarrollador Backend (en formación)",
    "presentation_p": "Estudiante de Ingeniería de Sistemas, con un fuerte interés en servidores, automatización y tecnologías como Raspberry Pi e IoT.",
    "about_h2": "Sobre Mí",
    "about_p1": "Soy estudiante de Ingeniería de Sistemas con pasión por construir sistemas backend eficientes y escalables. Mi viaje comenzó con la curiosidad por ver cómo funcionan los servidores y las redes, lo que me llevó a explorar automatización, IoT y proyectos con Raspberry Pi.",
    "about_p2": "A través de proyectos prácticos como configurar servidores domésticos y desarrollar sistemas de inventario en tiempo real, he adquirido experiencia en Python, Flask y gestión de bases de datos. Siempre estoy ansioso por aprender nuevas tecnologías y enfrentar problemas desafiantes.",
    "skills_h2": "Mis Habilidades",
    "skill_python_h3": "Python",
    "skill_python_p": "Construcción de lógica backend y scripts de automatización. Aprendí con Thinkpython2 de Allen Downey.",
    "skill_flask_h3": "Flask",
    "skill_flask_p": "Desarrollo de aplicaciones web ligeras.",
    "skill_sqlite_h3": "SQLite",
    "skill_sqlite_p": "Gestión de bases de datos locales para proyectos.",
    "skill_raspberry_h3": "Raspberry Pi",
    "skill_raspberry_p": "Aún aprendiendo a usarlo para IoT en mis proyectos.",
    "skill_web_h3": "Páginas Web Ligeras",
    "skill_web_p": "Usando HTML, CSS y un poco de JS. ¡Como esta página web!",
    "projects_h2": "Mis Proyectos",
    "project1_h3": "Control de Inventario Inteligente",
    "project1_p1": "Este proyecto me introdujo a la automatización y la lógica backend usando una Raspberry Pi 4. Construí un sistema de inventario en tiempo real con sensores, Python y una base de datos local, accesible a través de una aplicación web simple con Flask.",
    "project1_stack": "Raspberry Pi 4, Python, Flask, HTML, CSS, SQLite, GPIO",
    "project1_p2": "Me ayudó a entender cómo interactúan el hardware y el software, y me dio experiencia práctica con tecnologías web, IoT y alojamiento de servidores locales.",
    "project1_link": "Ver en GitHub",
    "project2_h3": "Servidor Doméstico",
    "project2_p1": "Este proyecto me ayudó a comprender cómo se comunican las computadoras detrás de escena. Configuré un servidor local para explorar redes, acceso remoto y alojamiento web desde cero. A través de él, alojé aplicaciones web pequeñas con Flask, gestioné transferencias de archivos con Samba y configuré seguridad básica usando UFW y Fail2Ban.",
    "project2_stack": "Ubuntu Server, Flask, Python, SSH, Samba, UFW",
    "project2_p2": "Esta experiencia me dio una mayor apreciación por la infraestructura backend y despertó mi interés en automatización de servidores y DevOps.",
    "project2_link": "Ver en GitHub",
    "project3_h3": "To do app",
    "project3_p1": "Este fue mi primer proyecto usando Flask en una página web, en combinación con una base de datos sencilla y pequeña. Fue una práctica del canal de YouTube freeCodeCamp.",
    "project3_stack": "Python Flask, SQLalchemy, HTML, CSS",
    "project3_p2": "Esta fue mi primera vez usando y aprendiendo un framework de Python y github para el control de versiones y mi punto de partida en el desarrollo backend.",
    "project3_link": "Ver en GitHub",
    "project4_h3": "Sitio Web de Portafolio Moderno",
    "project4_p1": "¡Esta página web es mi propio portafolio, completamente hecho por mí! Aprendí nuevas funciones de HTML, CSS y JS. En un futuro cercano, este proyecto utilizará Flask para integrar mi frontend con mi backend.",
    "project4_stack": "HTML, CSS, JS",
    "project4_p2": "Fue la primera vez que usé Javascript en una página web real para mostrar mis habilidades de frontend. Hay un repositorio de Github disponible para mostrar cómo evoluciona la página.",
    "contact_h2": "Contáctame",
    "contact_name_label": "Nombre y Apellido",
    "contact_name_placeholder": "Ingresa tu nombre completo",
    "contact_email_label": "Correo Electrónico",
    "contact_email_placeholder": "Ingresa tu correo electrónico",
    "contact_message_label": "Mensaje",
    "contact_message_placeholder": "Escribe tu mensaje",
    "contact_button": "Enviar Mensaje",
    "contact_email_link": "juanmanuelccampos@gmail.com",
    "contact_linkedin": "juanmaacampos",
    "contact_github": "juanmaacampos",
    "footer": "© {year} Juanma Campos | Esta página fue completamente hecha por mí ;)"
  },
  "pt": {
    "nav_logo": "Juan Manuel Campos",
    "nav_about": "Sobre",
    "nav_skills": "Habilidades",
    "nav_projects": "Projetos",
    "nav_contact": "Contato",
    "presentation_h1": "Juan Manuel Campos",
    "presentation_h2": "Desenvolvedor Backend (em formação)",
    "presentation_p": "Estudante de Engenharia de Sistemas, com forte interesse em servidores, automação e outras tecnologias, como Raspberry Pi e IoT.",
    "about_h2": "Sobre Mim",
    "about_p1": "Sou estudante de Engenharia de Sistemas com paixão por construir sistemas backend eficientes e escaláveis. Minha jornada começou com a curiosidade sobre como servidores e redes funcionam, o que me levou a explorar automação, IoT e projetos com Raspberry Pi.",
    "about_p2": "Por meio de projetos práticos, como configurar servidores domésticos e desenvolver sistemas de inventário em tempo real, adquiri experiência em Python, Flask e gerenciamento de bancos de dados. Estou sempre ansioso para aprender novas tecnologias e enfrentar problemas desafiadores.",
    "skills_h2": "Minhas Habilidades",
    "skill_python_h3": "Python",
    "skill_python_p": "Desenvolvimento de lógica backend e scripts de automação. Aprendi com o livro Think Python 2, de Allen Downey.",
    "skill_flask_h3": "Flask",
    "skill_flask_p": "Desenvolvimento de aplicações web leves.",
    "skill_sqlite_h3": "SQLite",
    "skill_sqlite_p": "Gerenciamento de bancos de dados locais para projetos.",
    "skill_raspberry_h3": "Raspberry Pi",
    "skill_raspberry_p": "Ainda aprendendo a usá-lo para projetos de IoT.",
    "skill_web_h3": "Páginas Web Simples",
    "skill_web_p": "Usando HTML, CSS e um pouco de JS. Como esta página!",
    "projects_h2": "Meus Projetos",
    "project1_h3": "Controle Inteligente de Inventário",
    "project1_p1": "Este projeto me apresentou à automação e à lógica backend usando um Raspberry Pi 4. Construí um sistema de inventário em tempo real com sensores, Python e um banco de dados local, acessível por meio de uma aplicação web simples em Flask.",
    "project1_stack": "Raspberry Pi 4, Python, Flask, HTML, CSS, SQLite, GPIO",
    "project1_p2": "Esse projeto me ajudou a entender como hardware e software interagem, além de me proporcionar experiência prática com tecnologias web, IoT e hospedagem de servidores locais.",
    "project1_link": "Ver no GitHub",
    "project2_h3": "Servidor Doméstico",
    "project2_p1": "Este projeto me ajudou a entender verdadeiramente como computadores se comunicam nos bastidores. Configurei um servidor local para explorar redes, acesso remoto e hospedagem web do zero. Por meio dele, hospedei pequenas aplicações web em Flask, gerenciei transferências de arquivos com Samba e configurei segurança básica com UFW e Fail2Ban.",
    "project2_stack": "Ubuntu Server, Flask, Python, SSH, Samba, UFW",
    "project2_p2": "Essa experiência me deu uma apreciação mais profunda pela infraestrutura backend e despertou meu interesse em automação de servidores e DevOps.",
    "project2_link": "Ver no GitHub",
    "project3_h3": "Aplicativo de Tarefas",
    "project3_p1": "Este foi meu primeiro projeto usando Flask em uma página web, combinado com um banco de dados simples e pequeno. Foi apenas uma prática do canal freeCodeCamp no YouTube.",
    "project3_stack": "Python Flask, SQLAlchemy, HTML, CSS",
    "project3_p2": "Foi a primeira vez que usei e aprendi um framework Python e GitHub para controle de versão, o que marcou meu ponto de partida no desenvolvimento de backend.",
    "project3_link": "Ver no GitHub",
    "project4_h3": "Site de Portfólio Moderno",
    "project4_p1": "Esta página web é o meu próprio portfólio, totalmente criado por mim! Aprendi novas funções de HTML, CSS e JS. Num futuro próximo, este projeto usará Flask para integrar meu frontend com meu backend!",
    "project4_stack": "HTML, CSS, JS",
    "project4_p2": "Foi a primeira vez que usei Javascript em uma página web real para mostrar minhas habilidades de frontend. Um repositório no Github está disponível para mostrar como a página está evoluindo.",
    "contact_h2": "Entre em Contato",
    "contact_name_label": "Nome e Sobrenome",
    "contact_name_placeholder": "Digite seu nome completo",
    "contact_email_label": "E-mail",
    "contact_email_placeholder": "Digite seu e-mail",
    "contact_message_label": "Mensagem",
    "contact_message_placeholder": "Escreva sua mensagem",
    "contact_button": "Enviar Mensagem",
    "contact_email_link": "juanmanuelccampos@gmail.com",
    "contact_linkedin": "juanmaacampos",
    "contact_github": "juanmaacampos",
    "footer": "© {year} Juanma Campos | Esta página foi inteiramente feita por mim ;)"
  }
}