{
    "en": {
      "nav_logo": "Juan Manuel Campos",
      "nav_about": "About",
      "nav_skills": "Skills",
      "nav_projects": "Projects",
      "nav_contact": "Contact",
      "presentation_h1": "Juan Manuel Campos",
      "presentation_h2": "Backend Developer (in training)",
      "presentation_p": "Systems Engineering student, strongly interested in servers and automation and some other tech stuff like Raspberry Pi and IoT.",
      "about_h2": "About Me",
      "about_p1": "I'm a Systems Engineering student with a passion for building efficient and scalable backend systems. My journey started with a curiosity for how servers and networks operate, leading me to explore automation, IoT, and Raspberry Pi projects.",
      "about_p2": "Through hands-on projects like setting up home servers and developing real-time inventory systems, I've gained experience in Python, Flask, and database management. I'm always eager to learn new technologies and tackle challenging problems.",
      "skills_h2": "My Skills",
      "skill_python_h3": "Python",
      "skill_python_p": "Building backend logic and automation scripts. I learned through Thinkpython2 from Allen Downey.",
      "skill_flask_h3": "Flask",
      "skill_flask_p": "Developing lightweight web applications.",
      "skill_sqlite_h3": "SQLite",
      "skill_sqlite_p": "Managing local databases for projects.",
      "skill_raspberry_h3": "Raspberry Pi",
      "skill_raspberry_p": "Still learning how to use it for IOT on my projects.",
      "skill_web_h3": "Light Webpages",
      "skill_web_p": "Using HTML, CSS and a bit of JS. Just like this webpage!",
      "projects_h2": "My Projects",
      "project1_h3": "Smart Inventory Control",
      "project1_p1": "This project introduced me to automation and backend logic using a Raspberry Pi 4. I built a real-time inventory system with sensors, Python, and a local database, accessible through a simple Flask web app.",
      "project1_stack": "Raspberry Pi 4, Python, Flask, HTML, CSS, SQLite, GPIO",
      "project1_p2": "It helped me understand how hardware and software interact, and gave me hands-on experience with web technologies, IoT, and local server hosting.",
      "project1_link": "View on GitHub",
      "project2_h3": "Home Server",
      "project2_p1": "This project helped me truly understand how computers communicate behind the scenes. I set up a local server to explore networking, remote access, and web hosting from scratch. Through it, I hosted small Flask web apps, managed file transfers with Samba, and configured basic security using UFW and Fail2Ban.",
      "project2_stack": "Ubuntu Server, Flask, Python, SSH, Samba, UFW",
      "project2_p2": "This experience gave me a deeper appreciation for backend infrastructure and sparked my interest in server automation and DevOps.",
      "project2_link": "View on GitHub",
      "contact_h2": "Contact Me",
      "contact_name_label": "Name and Surname",
      "contact_name_placeholder": "Enter your full name",
      "contact_email_label": "Email",
      "contact_email_placeholder": "Enter your email",
      "contact_message_label": "Message",
      "contact_message_placeholder": "Write your message",
      "contact_button": "Send Message",
      "contact_email_link": "juanmanuelccampos@gmail.com",
      "contact_linkedin": "juanmaacampos",
      "contact_github": "juanmaacampos",
      "footer": "© {year} Juanma Campos | This page was almost fully made by me ;)"
    },
    "es": {
      "nav_logo": "Juan Manuel Campos",
      "nav_about": "Sobre mí",
      "nav_skills": "Habilidades",
      "nav_projects": "Proyectos",
      "nav_contact": "Contacto",
      "presentation_h1": "Juan Manuel Campos",
      "presentation_h2": "Desarrollador Backend (en formación)",
      "presentation_p": "Estudiante de Ingeniería de Sistemas, con un fuerte interés en servidores, automatización y tecnologías como Raspberry Pi e IoT.",
      "about_h2": "Sobre Mí",
      "about_p1": "Soy estudiante de Ingeniería de Sistemas con pasión por construir sistemas backend eficientes y escalables. Mi viaje comenzó con la curiosidad por ver cómo funcionan los servidores y las redes, lo que me llevó a explorar automatización, IoT y proyectos con Raspberry Pi.",
      "about_p2": "A través de proyectos prácticos como configurar servidores domésticos y desarrollar sistemas de inventario en tiempo real, he adquirido experiencia en Python, Flask y gestión de bases de datos. Siempre estoy ansioso por aprender nuevas tecnologías y enfrentar problemas desafiantes.",
      "skills_h2": "Mis Habilidades",
      "skill_python_h3": "Python",
      "skill_python_p": "Construcción de lógica backend y scripts de automatización. Aprendí con Thinkpython2 de Allen Downey.",
      "skill_flask_h3": "Flask",
      "skill_flask_p": "Desarrollo de aplicaciones web ligeras.",
      "skill_sqlite_h3": "SQLite",
      "skill_sqlite_p": "Gestión de bases de datos locales para proyectos.",
      "skill_raspberry_h3": "Raspberry Pi",
      "skill_raspberry_p": "Aún aprendiendo a usarlo para IoT en mis proyectos.",
      "skill_web_h3": "Páginas Web Ligeras",
      "skill_web_p": "Usando HTML, CSS y un poco de JS. ¡Como esta página web!",
      "projects_h2": "Mis Proyectos",
      "project1_h3": "Control de Inventario Inteligente",
      "project1_p1": "Este proyecto me introdujo a la automatización y la lógica backend usando una Raspberry Pi 4. Construí un sistema de inventario en tiempo real con sensores, Python y una base de datos local, accesible a través de una aplicación web simple con Flask.",
      "project1_stack": "Raspberry Pi 4, Python, Flask, HTML, CSS, SQLite, GPIO",
      "project1_p2": "Me ayudó a entender cómo interactúan el hardware y el software, y me dio experiencia práctica con tecnologías web, IoT y alojamiento de servidores locales.",
      "project1_link": "Ver en GitHub",
      "project2_h3": "Servidor Doméstico",
      "project2_p1": "Este proyecto me ayudó a comprender cómo se comunican las computadoras detrás de escena. Configuré un servidor local para explorar redes, acceso remoto y alojamiento web desde cero. A través de él, alojé aplicaciones web pequeñas con Flask, gestioné transferencias de archivos con Samba y configuré seguridad básica usando UFW y Fail2Ban.",
      "project2_stack": "Ubuntu Server, Flask, Python, SSH, Samba, UFW",
      "project2_p2": "Esta experiencia me dio una mayor apreciación por la infraestructura backend y despertó mi interés en automatización de servidores y DevOps.",
      "project2_link": "Ver en GitHub",
      "contact_h2": "Contáctame",
      "contact_name_label": "Nombre y Apellido",
      "contact_name_placeholder": "Ingresa tu nombre completo",
      "contact_email_label": "Correo Electrónico",
      "contact_email_placeholder": "Ingresa tu correo electrónico",
      "contact_message_label": "Mensaje",
      "contact_message_placeholder": "Escribe tu mensaje",
      "contact_button": "Enviar Mensaje",
      "contact_email_link": "juanmanuelccampos@gmail.com",
      "contact_linkedin": "juanmaacampos",
      "contact_github": "juanmaacampos",
      "footer": "© {year} Juanma Campos | Esta página fue casi completamente hecha por mí ;)"
    }
  }